function answerOne(ans)
{
	switch(ans)
	{
		case "a13": alert("Правильно! Скорость данного алгоритма O(nLog(n))"); break;
		case "a12": alert("Неправильно! Данный алгоритм имеет скорость O(n^2). Он является медленным"); break;
		case "a11": alert("Неправильно! Данный алгоритм имеет скорость O(n^2). Он является медленным"); break;
	}
};

function answerTwo(ans)
{
	switch(ans)
	{
		case "a21": alert("Не во всех строках ошибка"); break;
		case "a22": alert("Не во всех строках ошибка"); break;
		case "a23": alert("Не во всех строках ошибка"); break;
		case "a24": alert("Правильный ответ. В 8 строке неправильный оператор вывода, в 11 и 14 счетчик выходит за пределы массива"); break;
		case "a25": alert("Не во всех строках ошибка"); break;
	}
};

function answerThree(ans)
{
	switch(ans)
	{
		case "a31": alert("Неправильный ответ. См. главу 'Обращение к элементам массива'"); break;
		case "a32": alert("Неправильный ответ. См. главу 'Обращение к элементам массива'"); break;
		case "a33": alert("Правильный ответ. См. главу 'Обращение к элементам массива'"); break;
		case "a34": alert("Данный фрагмент кода корректен."); break;
	}
}